#-------------------------------------------------------------------------------------
# practice1
# for 반복문을 활용해서 df_sample1 각 열의 평균을 구해보세요. 평균함수는 mean
#-------------------------------------------------------------------------------------
df_sample1 <- data.frame(
    a = rnorm(10),
    b = rnorm(10),
    c = rnorm(10),
    d = rnorm(10)
)

#-------------------------------------------------------------------------------------
# practice2
# 구구단 결과를 출력해보세요
#-------------------------------------------------------------------------------------
for (g in 2:9) {
    for (z in 1:9) {
        print(g * z)
    }
}

#-------------------------------------------------------------------------------------
# practice3
# 문자열 숫자가 섞여있는 벡터를 숫자형 벡터로 바꾸기
#-------------------------------------------------------------------------------------
x <- c(1, 5, 7, "10")
x1 <- NULL

for(i in x){
if(!is.numeric(i)){
    x2 <- as.numeric(i)
    x1 <- c(x1, x2)
}}


#-------------------------------------------------------------------------------------
# practice4
# 어떤 벡터의 summary 함수(my.sum)를 만들어보세요 (평균, 중간값, 최소값, 최대값, 합계)
# 결과는 데이터프레임으로 만들어주세요 (1행 5열)
#-------------------------------------------------------------------------------------
test <- rnorm(1000)

my.sum <- function(tt){
    my.sum <- data.frame(
        평균 = mean(tt),
        중간값 = median(tt),
        최소값 = min(tt),
        최대값 = max(tt),
        합계 = sum(tt)
    )
    return(my.sum)
}
my.sum(test)

#-------------------------------------------------------------------------------------
## practice5
# 1. 데이터 가져오기 (데이터 설명은 아래)
# 2. 컬럼이름 영문으로 변경하기
# 3. 숫자로 변환해보기
# 4. tidy 데이터로 변환해보기
# 5. 다시 wide로 변환해보기 (다른 변수에 저장)
# 6. tidy 데이터 중 month를 강남구의 11월, 12월만 추출
# 7. write.csv로 csv 파일로 저장하기
# https://docs.google.com/spreadsheets/d/e/2PACX-1vQVSDG9-3h2u7_KAk4C_g4Vc50PxM1aXxqZ4w6G4f3dpdObmla4lCqDRLMZEE6bBtpTZL4lK57wkWHR/pub?gid=1581715057&single=true&output=csv
# 혹은 budongsan.csv로 활용
#-------------------------------------------------------------------------------------
